# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 10  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, RLV, [15, 16, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, DWConv, [256, 3, 2]]  # 3-P3/8
  - [-1, 3, C2f, [256, True]]
  - [-1, 1, DWConv, [512, 3, 2]]
  - [-1, 3, C2f, [512, True]]
  - [-1, 1, SPPF, [512, 5]] # 7

# YOLOv8.0n head
head:
  - [7, 1, nn.Upsample, [None, 2, 'nearest']] # 8
  - [[-1, 4], 1, Concat, [1]]  # 9 cat backbone P4
  - [-1, 3, C2f, [512]]  # 10
# # # #
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 11
  - [2, 1, Narrow_band, [32, 32]]  # 12   GLRF = Narrow_band + Bright_band
  - [2, 1, Bright_band, [32, 32]]
  - [[-1, 11, 2, 12], 1, Concat, [1]]  #
  - [-1, 3, C2f, [896]]  # 15
# # # #
  - [-1, 1, DWConv, [1536, 3, 2]] # 16
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 3, C2f, [768]]          # 18
  - [15, 1, RepConv, [256]]      # 19
  - [18, 1, RepConv, [256]]      # 20
  - [19, 1, SFA, [64, 64]]
  - [20, 1, SFA, [64, 64]]
# # # #
  - [[21, 22], 1, Detect, [nc]]  # Detect(P3, P4, P5)